{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "čĊ": 257,
      "00": 258,
      "Ġ:": 259,
      "he": 260,
      "Ġt": 261,
      "at": 262,
      "Ġi": 263,
      "aa": 264,
      "!!": 265,
      "0000": 266,
      "Ġc": 267,
      "as": 268,
      "Ġw": 269,
      "df": 270,
      "us": 271,
      "ĠI": 272,
      "in": 273,
      "or": 274,
      "Ġa": 275,
      "Ġd": 276,
      "000": 277,
      "er": 278,
      "es": 279,
      "li": 280,
      "ly": 281,
      "Ġo": 282,
      "ed": 283,
      "gh": 284,
      "ho": 285,
      "ic": 286,
      "re": 287,
      "Ġb": 288,
      "Ġs": 289,
      "Ġto": 290,
      "Ġthe": 291,
      "Ġis": 292,
      "aaaa": 293,
      "!!!!": 294,
      "0000000": 295,
      "09": 296,
      "OO": 297,
      "al": 298,
      "am": 299,
      "et": 300,
      "ghe": 301,
      "iu": 302,
      "jg": 303,
      "lo": 304,
      "nt": 305,
      "om": 306,
      "on": 307,
      "op": 308,
      "st": 309,
      "sdf": 310,
      "tr": 311,
      "ĠS": 312,
      "ĠT": 313,
      "Ġit": 314,
      "Ġcat": 315,
      "lis": 316,
      "Ġof": 317,
      "Ġsp": 318,
      "67": 319,
      "EP": 320,
      "ET": 321,
      "En": 322,
      "Fe": 323,
      "IC": 324,
      "IS": 325,
      "Lat": 326,
      "NG": 327,
      "PR": 328,
      "The": 329,
      "]]": 330,
      "ae": 331,
      "ar": 332,
      "adf": 333,
      "ant": 334,
      "cat": 335,
      "ec": 336,
      "fg": 337,
      "glis": 338,
      "hb": 339,
      "hr": 340,
      "ld": 341,
      "le": 342,
      "mal": 343,
      "na": 344,
      "nd": 345,
      "pr": 346,
      "sd": 347,
      "sadf": 348,
      "to": 349,
      "tu": 350,
      "tic": 351,
      "ĠG": 352,
      "ĠM": 353,
      "Ġf": 354,
      "Ġg": 355,
      "Ġre": 356,
      "Ġth": 357,
      "Ġim": 358,
      "asd": 359,
      "Ġwas": 360,
      "use": 361,
      "ĠIS": 362,
      "ing": 363,
      "Ġand": 364,
      "Ġde": 365,
      "Ġdom": 366,
      "ght": 367,
      "gheiu": 368,
      "jge": 369,
      "ĠSO": 370,
      "ĠTH": 371,
      "Ġspec": 372,
      "EPIC": 373,
      "Englis": 374
    },
    "merges": [
      "č Ċ",
      "0 0",
      "Ġ :",
      "h e",
      "Ġ t",
      "a t",
      "Ġ i",
      "a a",
      "! !",
      "00 00",
      "Ġ c",
      "a s",
      "Ġ w",
      "d f",
      "u s",
      "Ġ I",
      "i n",
      "o r",
      "Ġ a",
      "Ġ d",
      "00 0",
      "e r",
      "e s",
      "l i",
      "l y",
      "Ġ o",
      "e d",
      "g h",
      "h o",
      "i c",
      "r e",
      "Ġ b",
      "Ġ s",
      "Ġt o",
      "Ġt he",
      "Ġi s",
      "aa aa",
      "!! !!",
      "0000 000",
      "0 9",
      "O O",
      "a l",
      "a m",
      "e t",
      "g he",
      "i u",
      "j g",
      "l o",
      "n t",
      "o m",
      "o n",
      "o p",
      "s t",
      "s df",
      "t r",
      "Ġ S",
      "Ġ T",
      "Ġi t",
      "Ġc at",
      "li s",
      "Ġo f",
      "Ġs p",
      "6 7",
      "E P",
      "E T",
      "E n",
      "F e",
      "I C",
      "I S",
      "L at",
      "N G",
      "P R",
      "T he",
      "] ]",
      "a e",
      "a r",
      "a df",
      "a nt",
      "c at",
      "e c",
      "f g",
      "g lis",
      "h b",
      "h r",
      "l d",
      "l e",
      "m al",
      "n a",
      "n d",
      "p r",
      "s d",
      "s adf",
      "t o",
      "t u",
      "t ic",
      "Ġ G",
      "Ġ M",
      "Ġ f",
      "Ġ g",
      "Ġ re",
      "Ġt h",
      "Ġi m",
      "as d",
      "Ġw as",
      "us e",
      "ĠI S",
      "in g",
      "Ġa nd",
      "Ġd e",
      "Ġd om",
      "gh t",
      "ghe iu",
      "jg e",
      "ĠS O",
      "ĠT H",
      "Ġsp ec",
      "EP IC",
      "En glis"
    ]
  }
}