{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "čĊ": 257,
      "00": 258,
      "aa": 259,
      "zz": 260,
      "Ġ:": 261,
      "ll": 262,
      "nn": 263,
      "mm": 264,
      "xx": 265,
      "dd": 266,
      "ff": 267,
      "ii": 268,
      "ee": 269,
      "gg": 270,
      "hh": 271,
      "jj": 272,
      "pp": 273,
      "ww": 274,
      "bb": 275,
      "he": 276,
      "kk": 277,
      "oo": 278,
      "rr": 279,
      "ss": 280,
      "qq": 281,
      "tt": 282,
      "Ġt": 283,
      "uu": 284,
      "Ġi": 285,
      "0000": 286,
      "!!": 287,
      "at": 288,
      "cc": 289,
      "yy": 290,
      "aaaa": 291,
      "vv": 292,
      "ĠI": 293,
      "Ġc": 294,
      "000": 295,
      "zzzz": 296,
      "as": 297,
      "ĠT": 298,
      "Ġw": 299,
      "df": 300,
      "us": 301,
      "nnnn": 302,
      "xxxx": 303,
      "dddd": 304,
      "iiii": 305,
      "OO": 306,
      "or": 307,
      "Ġa": 308,
      "Ġd": 309,
      "mmmm": 310,
      "ffff": 311,
      "eeee": 312,
      "gggg": 313,
      "hhhh": 314,
      "jjjj": 315,
      "pppp": 316,
      "wwww": 317,
      "bbbb": 318,
      "oooo": 319,
      "ssss": 320,
      "qqqq": 321,
      "ed": 322,
      "es": 323,
      "ho": 324,
      "in": 325,
      "li": 326,
      "ĠS": 327,
      "Ġo": 328,
      "llll": 329,
      "kkkk": 330,
      "rrrr": 331,
      "tttt": 332,
      "uuuu": 333,
      "0000000": 334,
      "ĠTH": 335,
      "EP": 336,
      "ET": 337,
      "LO": 338,
      "NG": 339,
      "er": 340,
      "gh": 341,
      "ic": 342,
      "le": 343,
      "ly": 344,
      "Ġb": 345,
      "Ġs": 346,
      "Ġto": 347,
      "Ġthe": 348,
      "Ġis": 349,
      "!!!!": 350,
      "cccc": 351,
      "yyyy": 352,
      "vvvv": 353,
      "ĠTHI": 354,
      "09": 355,
      "IC": 356,
      "LET": 357,
      "ge": 358,
      "ghe": 359,
      "iu": 360,
      "nt": 361,
      "op": 362,
      "pe": 363,
      "pr": 364,
      "re": 365,
      "st": 366,
      "sdf": 367,
      "tr": 368,
      "ĠG": 369,
      "ĠM": 370,
      "Ġf": 371,
      "Ġit": 372,
      "aaaaaaaa": 373,
      "ĠIS": 374,
      "zzzzzzzz": 375,
      "Ġdo": 376,
      "lis": 377,
      "ĠSOO": 378,
      "Ġof": 379,
      "EPIC": 380,
      "67": 381,
      "AA": 382,
      "AL": 383,
      "CA": 384,
      "CH": 385,
      "En": 386,
      "Fe": 387,
      "HA": 388,
      "ING": 389,
      "Lat": 390,
      "PR": 391,
      "TY": 392,
      "The": 393,
      "TAL": 394,
      "VE": 395,
      "]]": 396,
      "ae": 397,
      "am": 398,
      "ar": 399,
      "all": 400,
      "att": 401,
      "adf": 402,
      "ant": 403,
      "fg": 404,
      "glis": 405,
      "hb": 406,
      "hr": 407,
      "jge": 408,
      "ld": 409,
      "lo": 410,
      "mes": 411,
      "nd": 412,
      "nly": 413,
      "rt": 414,
      "sd": 415,
      "sadf": 416,
      "the": 417,
      "tic": 418,
      "ĠA": 419,
      "ĠO": 420,
      "Ġho": 421,
      "ĠLO": 422,
      "Ġpr": 423,
      "Ġre": 424,
      "ĠEPIC": 425,
      "ĠHA": 426,
      "kkk": 427,
      "Ġth": 428,
      "Ġim": 429,
      "Ġcat": 430,
      "asd": 431,
      "Ġwo": 432,
      "Ġwas": 433,
      "use": 434,
      "nnnnnnnn": 435,
      "xxxxxxxx": 436,
      "dddddd": 437,
      "iiiiiiii": 438,
      "Ġand": 439,
      "Ġde": 440,
      "mmmmmmmm": 441,
      "ffffffff": 442,
      "hhhhhhhh": 443,
      "pppppppp": 444,
      "wwwwwwww": 445,
      "oooooooo": 446,
      "ssssssss": 447,
      "qqqqqqqq": 448,
      "ing": 449,
      "ĠSO": 450,
      "ght": 451,
      "Ġspe": 452,
      "LETS": 453,
      "gheiu": 454,
      "ĠGOO": 455,
      "ĠMU": 456,
      "Ġfi": 457,
      "Englis": 458,
      "Ġspec": 459
    },
    "merges": [
      "č Ċ",
      "0 0",
      "a a",
      "z z",
      "Ġ :",
      "l l",
      "n n",
      "m m",
      "x x",
      "d d",
      "f f",
      "i i",
      "e e",
      "g g",
      "h h",
      "j j",
      "p p",
      "w w",
      "b b",
      "h e",
      "k k",
      "o o",
      "r r",
      "s s",
      "q q",
      "t t",
      "Ġ t",
      "u u",
      "Ġ i",
      "00 00",
      "! !",
      "a t",
      "c c",
      "y y",
      "aa aa",
      "v v",
      "Ġ I",
      "Ġ c",
      "00 0",
      "zz zz",
      "a s",
      "Ġ T",
      "Ġ w",
      "d f",
      "u s",
      "nn nn",
      "xx xx",
      "dd dd",
      "ii ii",
      "O O",
      "o r",
      "Ġ a",
      "Ġ d",
      "mm mm",
      "ff ff",
      "ee ee",
      "gg gg",
      "hh hh",
      "jj jj",
      "pp pp",
      "ww ww",
      "bb bb",
      "oo oo",
      "ss ss",
      "qq qq",
      "e d",
      "e s",
      "h o",
      "i n",
      "l i",
      "Ġ S",
      "Ġ o",
      "ll ll",
      "kk kk",
      "rr rr",
      "tt tt",
      "uu uu",
      "0000 000",
      "ĠT H",
      "E P",
      "E T",
      "L O",
      "N G",
      "e r",
      "g h",
      "i c",
      "l e",
      "l y",
      "Ġ b",
      "Ġ s",
      "Ġt o",
      "Ġt he",
      "Ġi s",
      "!! !!",
      "cc cc",
      "yy yy",
      "vv vv",
      "ĠTH I",
      "0 9",
      "I C",
      "L ET",
      "g e",
      "g he",
      "i u",
      "n t",
      "o p",
      "p e",
      "p r",
      "r e",
      "s t",
      "s df",
      "t r",
      "Ġ G",
      "Ġ M",
      "Ġ f",
      "Ġi t",
      "aaaa aaaa",
      "ĠI S",
      "zzzz zzzz",
      "Ġd o",
      "li s",
      "ĠS OO",
      "Ġo f",
      "EP IC",
      "6 7",
      "A A",
      "A L",
      "C A",
      "C H",
      "E n",
      "F e",
      "H A",
      "I NG",
      "L at",
      "P R",
      "T Y",
      "T he",
      "T AL",
      "V E",
      "] ]",
      "a e",
      "a m",
      "a r",
      "a ll",
      "a tt",
      "a df",
      "a nt",
      "f g",
      "g lis",
      "h b",
      "h r",
      "j ge",
      "l d",
      "l o",
      "m es",
      "n d",
      "n ly",
      "r t",
      "s d",
      "s adf",
      "t he",
      "t ic",
      "Ġ A",
      "Ġ O",
      "Ġ ho",
      "Ġ LO",
      "Ġ pr",
      "Ġ re",
      "Ġ EPIC",
      "Ġ HA",
      "kk k",
      "Ġt h",
      "Ġi m",
      "Ġc at",
      "as d",
      "Ġw o",
      "Ġw as",
      "us e",
      "nnnn nnnn",
      "xxxx xxxx",
      "dddd dd",
      "iiii iiii",
      "Ġa nd",
      "Ġd e",
      "mmmm mmmm",
      "ffff ffff",
      "hhhh hhhh",
      "pppp pppp",
      "wwww wwww",
      "oooo oooo",
      "ssss ssss",
      "qqqq qqqq",
      "in g",
      "ĠS O",
      "gh t",
      "Ġs pe",
      "LET S",
      "ghe iu",
      "ĠG OO",
      "ĠM U",
      "Ġf i",
      "En glis",
      "Ġspe c"
    ]
  }
}